import React from "react";

export default function UserPolicyComponent() {
  return (
    <div>
      <span>
        この利用規約（以下、「本規約」といいます。）は、株式会社Loa（以下、「当社」といいます。）が運営するファッションに特化したソーシャルネットワーキングサービス（以下、「CODA」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約をお読みいただき、同意して頂く必要があります。ご登録されたユーザーの方は利用規約に同意されたものとみなします。
      </span>
      <br />
      <br />
      <span>第１条（CODAのサービス）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          ユーザーは、CODAでInstagram(Facebook社)またはInstagramユーザーが提供する情報及びCODAユーザーが投稿するファッション情報をで閲覧することができます。
        </div>
        <br />
        <div className="ml-3">
          2. 当社は、InstagramAPIを使用して本サービスを提供しています。
        </div>
      </span>
      <br />
      <span>第２条（適用範囲）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          本規約は、ユーザーと当社との間のCODAの利用に関わる一切の関係に適用されるものとします。
        </div>
        <br />
        <div className="ml-3">
          2.
          当社はCODAに関し、本規約のほか、ご利用に当たってのルール等、各種の定め（以下、「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。
        </div>
        <br />
        <div className="ml-3">
          3.
          本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段定めなき限り、個別規定の規定が優先されるものとします。
        </div>
      </span>
      <br />
      <span>第３条（利用登録）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          本サービスにおいては、登録希望者が本規約に同意の上、当社の定める方法によって利用規約登録を申請し、当社がこの承認を登録希望者に通知することによって、利用登録が完了するものとします。
        </div>
        <br />
        <div className="ml-3">
          2.
          当社は、利用規約の申請者に以下の事由があると判断した場合、利用登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。
          <div className="ml-4">
            (1)利用登録の申請に際して虚偽の事項を届け出た場合
          </div>
          <div className="ml-4">
            (2)本規約に違反したことがあるものからの申請である場合
          </div>
          <div className="ml-4">
            (3)その他、当社が利用登録を相当でないと判断した場合
          </div>
        </div>
      </span>
      <br />
      <span>第４条（ユーザーIDおよびパスワードの管理）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          ユーザーは、自己の責任において、CODAのユーザーIDおよびパスワードを適切に管理するものとします。
        </div>
        <br />
        <div className="ml-3">
          2.
          ユーザーは、いかなる場合にも、ユーザーIDとパスワードを第三者に譲渡または貸与し、もしくは第三者と共有することはできません。当社は、ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には、そのユーザーを登録しているユーザー自身による利用とみなします。
        </div>
        <br />
        <div className="ml-3">
          3.
          ユーザーIDおよびパスワードが第三者によって使用されたことによって生じた損害は、当社に故意または重大な過失がある場合を除き、当社は一切の責任は負わないものとします。
        </div>
      </span>
      <br />
      <span>第５条（禁止事項）</span>
      <br />
      <span>
        <div className="ml-3">
          ユーザーは、CODAの利用にあたり、以下の行為をしてはなりません。
        </div>
        <br />
        <div className="ml-4">1. 法令または公序良俗に違反する行為</div>
        <div className="ml-4">2. 犯罪行為に関連する行為</div>
        <div className="ml-4">
          3.
          当社、CODAの他のユーザー、または第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
        </div>
        <div className="ml-4">
          4. 当社のサービスの運営を妨害するおそれのある行為
        </div>
        <div className="ml-4">
          5. 他のユーザーに関する個人情報等を収集または蓄積する行為
        </div>
        <div className="ml-4">6. 不正アクセスをし、又はこれを試みる行為</div>
        <div className="ml-4">7. 他のユーザーに成りすます行為</div>
        <div className="ml-4">
          8.
          当社のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為
        </div>
        <div className="ml-4">
          9.
          当社、本サービスの他のユーザーまたは第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為
        </div>
        <div className="ml-4">
          10.
          以下の表現を含み、または含むと当社が判断する内容を本サービス上に投稿し、または送信する行為
        </div>
        <div className="ml-5">⑴過度に暴力的な表現</div>
        <div className="ml-5">⑵露骨な性的表現</div>
        <div className="ml-5">
          ⑶人種、国籍、信条、性別、社会的身分、門地等による差別に繋がる表現
        </div>
        <div className="ml-5">
          ⑷自殺、自傷行為、薬物乱用を誘引または助長する表現
        </div>
        <div className="ml-5">
          ⑸その他反社会的な内容を含み他人に不快感を与える表現
        </div>
        <div className="ml-4">
          11. 以下を目的とし、または目的とすると当社が判断する行為
        </div>
        <div className="ml-5">
          ⑴営業、宣伝、広告、勧誘、その他営利を目的とする行為（当社が認めたものは除きます。）
        </div>
        <div className="ml-5">⑵性行為やわいせつな行為を目的とする行為</div>
        <div className="ml-5">
          ⑶面識のない異性との出会いや交際を目的とする行為
        </div>
        <div className="ml-5">
          ⑷他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為
        </div>
        <div className="ml-5">
          ⑸当社、本サービスの他のユーザー、または第三者に不利益、損害または不快感を与えることを目的とする行為
        </div>
        <div className="ml-5">
          ⑹その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為
        </div>
        <div className="ml-4">12. 宗教活動または宗教団体への勧誘行為</div>
        <div className="ml-4">13. その他、当社が不適切と判断する行為</div>
      </span>
      <br />
      <span>第６条（本サービスの提供の停止等）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          当社は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
        </div>
        <div className="ml-4">
          ⑴本サービスにかかるコンピュータシステムの保守点検または更新を行う行為
        </div>
        <div className="ml-4">
          ⑵地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合
        </div>
        <div className="ml-4">
          ⑶コンピュータまたは通信回線等の事故により停止した場合
        </div>
        <div className="ml-4">
          ⑷その他、当社が本サービスの提供が困難となった場合
        </div>
        <br />
        <div className="ml-3">
          2.
          当社は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害においても、一切の責任を負わないものとします。
        </div>
      </span>
      <br />
      <span>第７条（著作権）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          前項本文の定めるものを除き、本サービスおよび本サービスに関連する情報についての著作権およびその他の知的財産権はすべてFacebook社または投稿元であるInstagramまたはCODAのユーザーに帰属し、無断での複製、譲渡、貸与、翻訳、改変、転載、公衆発信（送信可能化を含みます。）、伝送、配布、出版、営業使用等をしてはならないものとします。
        </div>
        <div className="ml-3">
          2.
          本サービスを利用するユーザーが投稿した画像およびその他情報についての著作権およびその他の知的財産権の権利は、投稿元であるCODAのユーザーに帰属し、投稿したものが原因で著作権侵害などの問題に発展した場合、運営側は一切の責任を負わないものとします。
        </div>
        <div className="ml-3">
          3.
          本サービス上にCODAのユーザーが投稿した著作権および知的財産権の対象となっている画像やその他の情報を、運営側が本サービスの運営の一環として使用できるライセンスを付与するものとします。
        </div>
      </span>
      <br />
      <span>第８条（利用制限および登録抹消）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          当社は、ユーザーが以下のいずれかに該当する場合には、事前の通知なく、投稿を削除し、ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができます。
        </div>
        <div className="ml-4">⑴本規約のいずれかの条項に違反した場合</div>
        <div className="ml-4">
          ⑵登録事項に虚偽の事実があることが判明した場合
        </div>
        <div className="ml-4">
          ⑶当社からの連絡に対し、一定期間返信がない場合
        </div>
        <div className="ml-4">
          ⑷本サービスについて、最終の利用から一定期間利用がない場合
        </div>
        <div className="ml-4">
          ⑸その他、当社が本サービスの利用を適当でないと判断した場合
        </div>
        <br />
        <div className="ml-3">
          2.
          前項各号のいずれかに該当した場合、ユーザーは、当然に当社に対する一切の責務について期限の利益を失い、その時点におけて負担する一切の債務を弁済しなければなりません。
        </div>
        <br />
        <div className="ml-3">
          3.
          当社は、本条に基づき当社が行った行為によりユーザーに生じた損害について、一切の責任をおいません。
        </div>
      </span>
      <br />
      <span>第９条（退会）</span>
      <br />
      <span>
        <div className="ml-3">
          ユーザーは、当社が定める退会手続により、本サービスから退会できるものとします。
        </div>
      </span>
      <br />
      <span>第１０条（保証の否認および免責事項）</span>
      <br />
      <span>
        <div className="ml-3">
          1.
          当社は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証していません。
        </div>
        <br />
        <div className="ml-3">
          2.
          当社は、本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。
        </div>
        <br />
        <div className="ml-3">
          3.
          前項ただし書に定める場合であっても、当社は、当社の過失（重過失）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当社またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。
        </div>
        <br />
        <div className="ml-3">
          4.
          当社は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において取引、連絡または紛争等について一切の責任を負いません。
        </div>
      </span>
      <br />
      <span>第１１条（サービス内容の変更等）</span>
      <br />
      <span>
        <div className="ml-3">
          当社は、ユーザーに通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害賠償については一切の責任を負いません。
        </div>
      </span>
      <br />
      <span>第１２条（利用規約の変更）</span>
      <br />
      <span>
        <div className="ml-3">
          当社は、必要と判断した場合には、ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお、本規約変更後、本サービスの利用を開始した場合には、当該ユーザーは変更後の規約に同意したものとします。
        </div>
      </span>
      <br />
      <span>第１３条（個人情報の取扱い）</span>
      <br />
      <span>
        <div className="ml-3">
          当社は、本サービスの利用によって取得する個人情報については、当社「プライバシーポリシー」に従い適切に取り扱うものとします。
        </div>
      </span>
      <br />
      <span>第１４条（通知または連絡）</span>
      <br />
      <span>
        <div className="ml-3">
          ユーザーと当社との間の通知または連絡は、当社の定める方法によって行うものとします。当社は、ユーザーから、当社が別途定める方式に従った変更届け出がない限り、現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い、これらは、発信時にユーザーへ到達したものとみなします。
        </div>
      </span>
      <br />
      <span>第１５条（権利義務の譲渡の禁止） </span>
      <br />
      <span>
        <div className="ml-3">
          ユーザーは、当社の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。
        </div>
      </span>
      <br />
      <span>第１６条（準拠法・裁判管轄） </span>
      <br />
      <span>
        <div className="ml-3">
          1. 本規約の解釈にあたっては、日本法を準拠法とします。
        </div>
        <br />
        <div className="ml-3">
          2.
          本サービスに関して紛争が生じた場合には、当社の本社所在地を管轄する裁判所を専属的合意管轄とします。
        </div>
      </span>
      <br />
      <div style={{ textAlign: "right" }}>
        更新日2021年8月1日
        <br />
        制定日2021年4月1日
        <br />
        以上
      </div>
    </div>
  );
}
